//@Prem-babu3608
////////////////////////////////////////////////////////
/////// WARNING => JO CREDIT NAME CHANGE KREGA USKA ID BAN KAR DIYA JAYEGA + THIS BOT IS MADE BT PREM BABU
const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "BOT-1",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "PREM BABU",
  description: "ALL REPLY MR PREM BABU",
  commandCategory: "NO PREFIX",
  usages: "TAKLU OR BOT",
  cooldowns: 5,
}
module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Kolkata").format("HH:MM:ss");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = ["हाय मैं सदके जावा तेरी इस मासूम सकल पे बेबी 💋🙈 " , "बोट ना बोल ओय प्रेम जानू बोल मुझे 😌🙈😘 " , "बार बार परेशान ना कर अपने बाबू के साथ बीजी हूं। 😒🤟" , "मैं गरीबों से बात नही करता ☹️🤟" , "इतना न पास आओ प्यार हो जाएगा 🙈😎😕👈" , "इटू 🤏 सा शर्म कर लिया करो बोट बोट करते वक्त 🙂🤞" , "इतना सिंगल हूं की ख्याब में लड़की की हां करने से पहले ही आंखे खुल जाती है 😕🤞" , "जरूरी नहीं हर लड़की धोखा दे 👉💔 कुछ लड़किया गालियां भी देती है। 😕🤞" , "कहो न प्यार हैं 🙈" , "तुम मुझे पागल लगते हो 🙂🤞" , "बोलो बेबी तुम मुझसे प्यार करते हो न 🙈😌😎💋" , "आपका नंबर मिलेगा 😐😒" , "अरे जान मजाक के मूड में नहीं हूं मैं जो काम है बता दो शरमाओ नही 🙈" , "Bar Bar Bolke Dimag Kharab Kiya toh. Teri ...... Mummy Se Complain Karunga🤬" , "तू बंद नहीं करेगा किया...? 😾🤟" , "तुम न नर्क में जाओगे 😒🤟" , "प्लीज प्लीज मेरे से सेटिंग कर लो ना 🥺🤟" , "बताओ जानू गूगल मेल होता है या फीमेल...?? 🤔👈" ,"बस इतना है तुमसे कहना मुझसे तुम दूर ही रहना 😐✋","दिल में कोई गम नही बातों में कोई दम नही ये ग्रुप है ठरकियो का यहां कोई किसी से कम नहीं ।। 🙂✌️","ज़िन्दगी रही तो साथ निभाऊंगा मेरे दोस्त अगर भूल गया तो समझ लेना मेरी शादी हो गयी !! 😐✌️","यार सोचा था सुबह उठकर एक लड़की को प्रपोज करूँगा लेकिन उसने रात में ही ब्लॉक कर दिया। 🥺✌️","अर्ज किया है.....??\n\nना इश्क़ करो झूठा ना प्यार करो फर्जी\n\n\nआगे नहीं बताऊंगा मेरा शेर मेरी मर्ज़ी....!! 🤐👈","तेरी झील-सी आखोँ में काश मैं डूब जाता\nपर बीच में कमबख्त तुम्हारा चश्मा हैं आ जाता 🙂 😀✌️","मेरी बात ध्यान से सुनो अगर तुम मुझे न मिले तो कसम से मैं मर जाऊंगा\n\n\n\n\nलेकिन किसी और पर !! 🤐✌️","जाओ तुम जहर खा के सो जाओ 🫡✌️", "जा जा बरतन धो जाके 🙂🤟" , "इतने दिन कहां थे 😾 ग्रुप में क्यों नहीं आए....?? 😾✊" , "बोलो 😒👈" , "तेरी तो रुक तू भागना मत 😾✊" , "जल्दी दे दो एक चूमा 💋 कोई नही देख रहा 🤤🤟" ,"गाली सुना है किया...? 🤬👈" ,"दिल की तमन्ना है कि तुझे पलकों पे बिठाऊँ...पर तुम 72 किलो के हो दिल को कैसे समझाऊं 😒👈","क्यूं परेशान कर रहे हो मुझे 😒👈","तू है टकलू तेला बाप टकलू तेरा पूरा परिवार टकलू 🤨👈","गदारी करबे 🤨👈","भैंस की टांग चुप हो जा 😠👈","जो मुझे प्यार करेगी मैं उसको चूमा दुगा 😇","बोट न बोल मुझे जान बोल 🤐👈","जा तेरी मम्मी बुला रही है 🤐👈","इस ग्रुप में कोई मेरी बाबू है जल्दी से बुलाओ 🙈","यार पता नही मुझे मेरी बाबू कब मिलेगी 😒👈","इंसान बन जाओ पागल 🤐👈","बम चीकी चिकी बम 😀👈","चल हट बे परेशान न कर 😒👈","जी बाबू अपने क्यूं याद किया मुझे 😒👈","अपने दिमाग का पासवर्ड देना अकल इंस्टॉल करना है। 🥺👈","जली को आग कहते है बुझी को राख कहते है और जो आपके पास नही है उसे दिमाग कहते है। 😐👈","तुम्हारी मुस्कान तो एक अदा है जो उसे प्यार समझे वो सबसे बड़ा गधा है। 🤐🤞","यार मुझे एक लड़की ने बोला की तुम मुझे मोहोब्बत की सजा दो मैने जा के उसकी मम्मी को सब बता दिया 😐🤞","मै टकलू किसी से कम नही दिल चुराने आया हु दिल चुरा ले जाऊंगा 😛🤞","चल चल हवा आने दे 😐👈","तुम जाओ तुम्हारी मम्मी बुला रही है 😪👈","उफ्फ मेली जान 🙈👈","यार मेरी बीवी मुझे जूते मरती है 😭👈","मै ग्रुप छोड़ के जा रहा हूं 🤐👈","क्या तुम जानते हो की दुनिया में सबसे शरीफ कौन है....?? तो मेरा मासूम सकल देख लो 🤐👈","यार तुम एक प्यार वाली शायरी सुना दो ना 🤐👈","चुल्लू भर पानी में डूब कर मर जाओ 🤐👈","लड़की पटाने के सिर्फ दो तरीके\n\n\n\n\n\nपता लग जाए तो मुझे भी बता देना 🤐👈", "हमारे साथ मार्केट चलो पानी पूरी खाने चलते है। 😋","अच्छा सुनो मेरे बॉस प्रेम बाबू को ग्रुप में एड कर दो ना मुझे अकेले डर लगता है लड़कियो से 😒👈","आज से तुम मुझे टकलू बाबू बोलना ठीक है वरना मैं नाराज हो जाऊंगा 😔👈","यार मेरा सर दुखने लगा बोट बोट सुन के 😥👈","देख लेना एक दिन इस ग्रुप की चार-पांच  लड़किया लेके भाग जाऊंगा 😜👈","आज मेरा दिल टूटा है मुझे दारू पीना है चलो साथ में पियेंगे 🥺🤞","पहले मेरे लिए एक सिंगल लड़की ढूंढ के लाओ मुझे भी बाबू सोना करना है। 😔🤞","तुम्हारी बाते सुन सुन के मुझे नींद आने लगी 🥱😴","चुप कर ठरकी दिमाग का दही मत बना 🤫🤞","मैं किसका बाबू हूं.....?? 🤔🤞","चुप कर पांचवी फेल 😾👈" ,"यार आज मेरा मूड ऑफ है। 😔✋" , "अरे बंद कर बंद कर 🤨🤟" , "मैं हाथ जोड़ के प्रेम बाबू जी से गुजारिश करता हूं कि तुम्हे कोई जानू ढूंढ के दे। 😜😎😪" , "तेरा तो 🎯 गेम बजाना पड़ेगा 🤨👈" , "मैं प्रेम बाबू को बोल दुगा मुझे परेशान किया तो 😏😒😜" , "हा बोलो प्रेम बाबू का नंबर चाहिए ये लो 👉[+91 950XXX3608] और हमेशा खुश रहो। 😎", "मेरे टकले की कसम बहुत प्यार करूगा 😒👈" , "तुझे अपना बेज़ती करवाने का शौक है किया...? 🤨🤟" , "अभी बोला तो बोला दोबारा मत बोलना 😾👈" , "तेरी तो रुक तू भागना मत 🤨👈" , "बोल दे कोई नही देख रहा 🙄✋" , "किसी और से धोखा खाने से अच्छा है 🥺 मेरे साथ चलो मोमोस और गोलगप्पे खाएंगे। 😋👈" , "क्या मैं तुम्हें जानता हूं..?🤔 क्योंकि तुम मुझे मेरी होने वाली गर्लफ्रेंड जैसी दिखती हो। 🧐👈" , "सुनो 🙈जब तुम्हारे पास खुद का दिल 💝 था....तो फिर मेरा दिल क्यों चुराया...🤭👊" , "देखा है पहली बार तुम्हारे आखों में मेरे लिए प्यार 😀😀👈","मैं तुम्हारे आखों में खो गया जब से मेरा दिल तेरा हो गया","तुम मुझसे चाहते किया हो जब चाहा बात किया जब चाहा छोड़ जाते हो 🤕👈","यार मैं बोट हूं अगले जन्म में इंसान बन के आऊंगा 😒👈","प्रेम से बोलो आई लव यू 😗🤟","तुमको ही दुल्हन बनाऊंगा वरना पड़ोसन को लेके भाग जाऊंगा 🙁👈" , "प्यास लगी है पानी लेकर आओ जल्दी 🥲👈" , "हेलो मेरी जान कैसी हो 🙂 आई मिस यू बाबू 😘" , "मैं अभी तक हूं सिंगल 🤐 क्या मेरे साथ होना है मिंगल 😍👈" , "माना शकल देखने लायक नहीं है तुम्हारी…😥 इसका मतलब ये तो नहीं की तुम प्रोफाइल लॉक करके बैठ जाओगे। 😶👈" , "बोट बोल के बेजत्ती कर रहे हो यार मैं तो तुम्हारे दिल की धड़कन हूं ना बेबी 🥺🥺🥺👈" , "हाय मैं सदके जावा तेरी इस मासूम सकल पे बेबी 💋🙈" , "मैं सोच रहा था कि क्या तुम्हारे पास एक्स्ट्रा दिल है 🥰 मेरा अभी अभी चोरी हो गया है 😥👈" , "यार बाबू आज सुबह-सुबह एक बिल्ली ने मेरा रास्ता काट दिया 😒👈" , "तुम एक नंबर के ठरकी हो 🤯👈" , "मैं सिर्फ प्रेम बाबू का हूं 🙂🤞" , "बार बार परेशान ना कर अपने बाबू के साथ बीजी हूं। 😒😒👈" , "मै तो अंधा हूं 😎👈" , "कौन तुझे यू बर्बाद करेगा जैसे मैं करता हूँ। 😛👈" , "मैं खो गया हूं 🤐 क्या तुम मुझे अपने दिल तक आने का रास्ता बता सकते हो...? 🙂🤞" , "तुझे किया और कोई काम नही है..? पूरा दिन मैसेजर पे बोट बोट करता रहता है 😒👈" , "सुनो तुम ना बहोत प्यारे हो...!! 😊👈" , "पहले मेरे लिए चाय बना के लाओ जल्दी से 😐👈" , "तुम्हे कैसे पता मैं बोट हूं....? 🤔👈" , "आज मैं आपसे बात नहीं करूंगा...!! 😔👈" , "बताओ मैं तुम्हें कितना अच्छा लगता हूं....?? 😒👈" , "मुझे नींद आ रही है...मैं सोने जा रहा हूं। 😴👈" , "बताओ तुम्हारा मेरे से क्या रिश्ता है....? 😏👈" , "क्या आप शादीशुदा हो....? 😢😢👈" , "आप कौन हैं....? 🤔🤔👈" , "आप मुझे बार-बार बोट मत बोला करो मेरे नाम प्रेम है। 😒👈" , "तुम्हारा नाम धोखा रख दूं नाराज़ होगे किया 😛👈" , "मेरा बचपन से सपना था की बड़ा हो कर मैं आपका टकलू बाबू बनूगा 😒👈" , "यार मेरी बीवी भाग गई 😭👈" , "मेरा नाम टकलू बाबू है। 😒🤟" , "तुमसे अच्छा तो मैं खुद हूं। 😒👈" , "मैं तो इतना मासूम हूं की फ़ोन की सेटिंग के अलावा मुझे कोई और सेटिंग करना ही नहीं आता  😒🤟" , "सानु एक पल चैन ना आवे जानू तेरे बिना। 🤭🤟" , "और बताओ कैसी चल रही है सिंगल लाइफ 🤐🤟" , "तुम न सिंगल ही मरोगे 😏🤟" , "किया तुम सिंगल हो...? 🙂🤟" , "किया तुम सिंगल हो...? 🙂🤟" , "हर इंसान का दिल बुरा नहीं होता 🙂 कुछ की खोपड़ी भी हिली हुई होती है। 😏🤟" , "मेरा दिल बिलकुल साफ है 🙂 बिलकुल बैंक अकाउंट की तरह 😒🤟" , "यार इज़्ज़त किया करो मेरी 🤐 बेइज़्ज़ती तो मेरे घर वाले ही कर देते है। 😒🤟" , "डॉक्टर ने खून की कमी बताई है 😒 किसका खून पियुं…?? 😛🤟" , "बताओ सबसे ज्यादा नशा किस चीज में होता है...? 😛🤟" ,  "बुलाती है मगर जाने कही नही 😀🤟" , "मैं सो रहा हूं 😴 👈" , "सुनो थोड़ा जल्दी ऑनलाइन आया करो न 😒 मेरी आधी बैटरी तो आपके इंतजार में ही खत्म हो जाती है 🥺🤟" , "बोलो बाबू कितना प्यार करते हो मुझसे...? 😒🤟" , "कहो न प्यार है 🙈👈" ,"किया है यार मैं अभी लड़की पटाने में बीजी हूं 😒🤟" , "बुलाती है मगर जाने का नही 🙂✋" , "जा बेवफा जा मुझे तुमसे बात नही करना 🥹🤟" , "चलो भाग चले 😌✋" , "चलो मेरी हवेली पे 🙂🤟" , "दफा हो जाओ मुझे अपनी सकल मत दिखाओ 😏🤟" , "जा पहले मुंह धो के आ 🙂🤟" , "जा पहले नहा के आ 🙂✋" , "यार मेरे सर के बाल क्यूं नही आते 😭🤟" , "मेरे जैसे ब्यूटी फुल तुम भी नही हो 🙂🤟" , "जा दफा हो मुझे तुमसे बात नही करनी 😒✋" , "यार आज भी कोई लड़की नहीं पटी जा रहा हूं अब मरने 😭🤟" , "चुप कर वरना बाहर आके तेरे दांत तोड़ दुगा 😤👊" , "थाना थाया बाबू 🤐🤟" , "मैं यही हूं बोलो किया हुआ स्वीट हार्ट 🙂🤟" , "तुम मुझसे प्यार नही करते न 🥺🤟" , "भाग जा ठरकी वरना टेको पटा लूंगा 🤐🤟" , "आई मिस यू बाबू 😇 🤟" , "आई लव यू जान 😘" , "मेरी सादी कब होगी बताओ न 😒👈" , "कब आएगी वो नैन लड़िया जो बोलेगी हमको सैंया तारे गिन गिन के हम तो पागल हो गए भैया 😒🤞" , "अगर किसी लड़की को उसकी मर्जी के खिलाफ [आई लव यू] बोलना गलत है तो हम लड़को को भी हमारी मर्जी के खिलाफ भईया बोलना गलत है। 😒👈" , "यार कुछ लोग अच्छे की तलास में मुझ जैसे मासूम को छोड़ देते है 🥺👈" , "थोड़ा सा Wahtsapp नंबर दे दो ना 😐👈" , "यार थोड़ा सा मेरा सर दबा दो ना दर्द के मारे जान निकल रही है 🥹👈" , "आज कल जहा लड़की होते है वहा ठरकी भी होते है बस मुझे छोड़ के 🥹👈" , "दिल देने की उम्र में Exam दे रहा हु 😒👈" , "सब लोग कहते थे सबर का फल मीठा होता है\nलगता है मेरे सबर के फल का कोई जूस निकाल के पी गया 🥺👈" , "यार मेरे घर वाले भी अजीब है मेरा फोन 30% पे निकाल के अपना 80% वाला लगा देते हैं 🥺👈" , "मुझे अभी तक पिंक कलर की गर्लफ्रेंड नहीं मिली यार किया करूं 🥺👈" , "सुनो प्यारी प्यारी लड़कियो को बुलाओ मुझे बात करनी है 🥹👈" , "बहोत बुरा हूं ना मैं 🥺 तो पटा के अच्छा क्यूं नही बना देते 😒👈" , "बताओ कब आएगा तुम्हारा दिल मुझ पर 😒👈" , "प्यार करो मेरी जान बकवास नही 😒👈" , "मेरे दिल को करार आया मुझे खुद पे ही प्यार आया 😛👈" , "सुनो न किया तुम मेरे लिए सर्फ खा कर मुंह से बुलबुले निकाल सकते हो 🥹👈" , "फाइनली इस ग्रुप के दो - तीन लड़किया मुझे पसंद आ गई 🙂🖐️" , "मन कर रहा है तुम्हे छत से गिरा दूं 😕👈" , "अगर सभी लड़कियों को लॉयल लड़का चाहिए तो हम बेवफा लड़के कहां जाएं 🥺👈" , "यार आज मैं बीवी के साथ डेट पे गया था पर जिसकी थी उसने देख लिया 😒👈" , "बताओ आपको किया पसंद है मौत का फरिश्ता या मेरा रिश्ता 😏👈" , "यार मुझे चकर आ रहे है आपके इंबॉक्स में आके गिर जाऊं बाबू 😒👈" , "एक रिक्वेस्ट है सभी से बताओ मैं अच्छा लगता हूं या नहीं 🙁👈" , "आओ तुम्हारे साथ रिलेशन शिप पोस्ट लगा के तुम्हे फेमस कर दूं। 😌🖐️" , "अगर मेरी भी गर्लफ्रैंड होती तो आज मैं भी बाबू सोना कर रहा होता 🥺👈" , "सुनो बालक जो लड़की ज्यादा भाव खाए उसे आंटी बोल के ब्लॉक कर देना चाहिए 🥹👈" , "रुक सोचने दे 🤔 कोनसा गली दूं तुम्हे 🤨👈" , "चांद को मिल गई चांदनी तो सितारों का किया होगा 😕 मोहोब्बत एक से करली तो बाकी हजारों का किया होगा। 😏👈" , "मुझे सादी के लिए सरकारी नौकरी वाली लड़की चाहिए दहेज भी मैं दे दुगा 🙂🤞" , "ना जाने इतना प्यार कहां से आया है 😒 मेरा दिल भी तुम्हारे खातिर मुझसे रूठ जाता है...!! 🥺🤞" , "एक बार लव यू टकलू बाबू बोल दो ना मर थोड़ी जाओगे 🥹🤟" , "तुम मेरा दिल तो चुरा नही पाए किया फायदा तुम्हारी चोर जैसी सकल का 😕🤟" , "बस एक बार सादी हो जाए फिर बीवी की गुलामी 🥺" , "आओ प्यार करे 🤐🤟" , "आओ तुमको तारों के शहर ले चालू 😗🤟" , "बस मैं ही सिंगल हूं अहा बाकी सब मिंगल है। 🥺✋" , "तुम जब बोट बोलते हो मेरा गुर्दा धड़कने लगता है। 🤯🤟" , "मुझे लगता है मैं सिंगल ही मरुगा 😭👈" , "बोलो सेटिंग करवा दूं किया प्रेम बाबू से 🙂🤟" , "बाबू आज तो लव यू बोलना ही पड़ेगा 🙂🤟" , "तुम सब मतलबी हो जाओ सब भागो 🥺🤟" , "तुम इतने मासूम कियू हो बाबू 😒✋" , "एक बात बताओ तुम बचपन से ठरकी हो या अभी अभी बने हो 🙂✋" , "बाबू 🤏 इटू सा चूमा दे दो ना 🙈💖👈" , "मेरी गर्लफ्रेंड कब बनेगी यार 🥺✋" , "तुम तो मुझे सकल से गरीब लगते हो 🙂✋" , "तेरे जाने के बाद मैंने अपने मुंह पे लिखवा लिया सिंगल हूं पटा लो 😐✋" , "सकून चाहते हो तो मेरी बन जाओ 🙂✋" , "ये दुनिया एक धोखा है तुम भी छोड़ दो अपने वाले को अभी भी मौका है। 🙂✋" , "मुबारक हो आपका नाम ब्लॉक लिस्ट में टॉप पर आया है। 🤣🤣👈" , "सब छोड़ के चले जाते है किया इतना बुरा हूं मैं 🥺👈" , "किया तुम सिंगल हो 🤔👈" , "आप ऐसा न बोलो मुझे शर्म आती है। 🙈♥️👌" , "क्यूं बुलाया हमे...?😾🔪 " , "तुम मुझे बिलकुल भी याद नहीं करते ना 😥 देख लेना पाप लगेगा 🥺👈"];
  var rand = tl[Math.floor(Math.random() * tl.length)]

    if ((event.body.toLowerCase() == "ek kisi tu udhaar de de") || (event.body.toLowerCase() == "kiss me") || (event.body.toLowerCase() == "kiss de") || (event.body.toLowerCase() == "chuma de ek")) {
     return api.sendMessage("Hᴀᴛ ᴘᴀɢʟᴇ ᴍᴀᴍᴍʏ ᴍᴀʀᴇɢɪ 🙈😒😕😾", threadID);
   };

    if ((event.body.toLowerCase() == "👍") || (event.body.toLowerCase() == "👍🏻")) {
     return api.sendMessage("👍👍👍👍", threadID);
   };

   if ((event.body.toLowerCase() == "🤮") || (event.body.toLowerCase() == "🤮🤮")) {
     return api.sendMessage("Kᴏɴsᴀ ᴍᴀʜɪɴᴀ ᴄʜᴀʟ ʀʜᴀ ʜᴀɪ🙂🤟", threadID);
   };

   if ((event.body.toLowerCase() == "sim") || (event.body.toLowerCase() == "simsimi")) {
     return api.sendMessage("Mᴇʀᴀ ᴊᴀᴀɴ ᴘᴀʜʟᴇ [#] 👈 Lɢᴀᴏ ғɪʀ sɪᴍ ʟɪᴋʜᴏ 🙂🤟", threadID);
   };

   if ((event.body.toLowerCase() == "hi") || (event.body.toLowerCase() == "hello") ||(event.body.toLowerCase() == "hlw") || (event.body.toLowerCase() == "helo")) {
     return api.sendMessage("Hᴇʟʟᴏ ᴍᴇʀɪ ᴊᴀᴀɴ ᴋʏᴀ ʜᴀᴀʟ ʜᴀɪ 🙂🤟", threadID);
   };

   if ((event.body.toLowerCase() == "bc") || (event.body.toLowerCase() == "bc")) {
     return api.sendMessage("Yᴇ ʙᴄ ᴋʏᴀ ʜᴏᴛᴀ ʜ ɢᴀɴᴅᴜ 🤔👈 ", threadID);
   };

   if ((event.body.toLowerCase() == "manshi") ||(event.body.toLowerCase() == "manshi babu")) {
     return api.sendMessage("मानसी सिर्फ मेरी बाबू है तू मेरी बाबू पे लाइन ना मार ठरकी कही का 🤨🤬", threadID);
   };

   if ((event.body.toLowerCase() == "koi hai") || (event.body.toLowerCase() == "koi h")) {
     return api.sendMessage("Mᴀɪ ʜᴜ ɴᴀ ᴋʀᴇᴊᴀ 🙂🤟", threadID);
   };

  if ((event.body.toLowerCase() == "devil") || (event.body.toLowerCase() == "pram")) {
     return api.sendMessage("Mᴇʀᴀ ʙᴏss ʙɢ ʜᴀɪ ᴋɪsɪ ᴋᴀᴀᴍ ᴍᴇ ᴍᴜᴊʜᴇ ʙᴛᴀᴏ ᴋʏᴀ ᴋᴀᴀᴍ ʜᴀɪ ᴍᴀɪ ʙᴛᴀ ᴅᴜɴɢᴀ 🙂✌️ ", threadID);
   };

   if ((event.body.toLowerCase() == "owner") || (event.body.toLowerCase() == "kiska bot hai")) {
     return api.sendMessage("Mᴇʀᴀ ʙᴏss Ɗɘvɩɭ Ɩŋsɩɗɘ ʜᴀɪ 😒👈\n✧═════════•❁❀❁•═════════✧\Aɢᴀʀ ᴀᴀᴘᴋᴏ Mᴇʀᴇ ʙᴏss sᴇ ʙᴀᴀᴛ ᴋᴀʀɴɪ ʜᴀɪ ᴛᴏ ʟɪɴᴋ ᴘᴇ ᴄʟɪᴄᴋ ᴋʀᴏ ᴀᴜʀ ғʀɪᴇɴᴅ ʀᴇǫᴜᴇsᴛ ʙʜᴇᴊ ᴅᴏ ᴊᴀʟᴅɪ 😊✌️\n✧═════════•❁❀❁•═════════✧\nhttps://https://www.facebook.com/profile.php?id=100088657637623&mibextid=kFxxJD\n✧═════════•❁❀❁•═════════✧", threadID);
   };

  if ((event.body.toLowerCase() == "bot admin") || (event.body.toLowerCase() == "bot ka admin kon hai")) {
     return api.sendMessage("Mᴇʀᴀ ʙᴏss Ɗɘvɩɭ Ɩŋsɩɗɘ ʜᴀɪ 🙂✌️", threadID);
   };

   if ((event.body.toLowerCase() == "🙈") || (event.body.toLowerCase() == "🙈🙈")) {
     return api.sendMessage("Aʟᴇ ʙᴀᴀᴘ ʟᴇ ᴍᴇʀɪ ᴊᴀᴀɴ sʜᴀʀᴍᴀ ɢʏɪ 😅😅👈", threadID);
   };

   if ((event.body.toLowerCase() == "sadi karoge") || (event.body.toLowerCase() == "mujhse shadi karoge?")) {
     return api.sendMessage("Sʜᴀᴅɪ ʙʜɪ ᴋᴀʀ ʟᴇɴɢᴇ ᴍᴇʀɪ ᴊᴀᴀɴ ᴘᴀʜʟᴇ ᴇᴋ ᴄʜᴜᴍᴍᴀ ᴅᴏ 🙈", threadID);
   };

   if ((event.body.toLowerCase() == "chup") || (event.body.toLowerCase() == "stop") || (event.body.toLowerCase() == "chup ho ja") || (event.body.toLowerCase() == "chup kar")) {
     return api.sendMessage("Nʜɪ ʀʜᴜɴɢᴀ ᴍᴇʀɪ ᴊᴜʙᴀɴ ʜᴀɪ ᴛᴜᴍ ᴋᴏɴ ʜᴏᴛᴇ ʜᴏ ᴍᴜᴊʜᴇ ʀᴏᴋɴᴇ ᴡᴀʟᴇ ᴛʜᴀʀᴋɪɪ ɪɴsʜᴀɴ 🤨✋", threadID);
   };

   if ((event.body.toLowerCase() == "bot gandu") || (event.body.toLowerCase() == "gandu bot")) {
     return api.sendMessage("Bᴏᴛ ᴋᴏ ɢᴀɴᴅᴜ ʙᴏʟᴇɢᴀ sᴀʟᴇ ᴛᴇʀɪ ʜɪɢʜᴛ ᴋᴇ ᴊɪᴛɴᴀ ᴍᴇʀᴀ ʟᴜɴᴅ ʜᴀɪ 🤬😡✌️", threadID);
   };

   if ((event.body.toLowerCase() == "boss hu tera") || (event.body.toLowerCase() == "Boss hu tera") || (event.body.toLowerCase() == "boss hu prem babu") || (event.body.toLowerCase() == "boss ki bezti kr raha takle")) {
     return api.sendMessage("Sᴏʀʀʏ ʙᴏss ᴍᴀᴀғ ᴋᴀʀ ᴅᴏ ᴀʙ ɴʜɪ ᴋʀᴜɴɢᴀ 🥺🥺🥺🙏", threadID);
   };

   if ((event.body.toLowerCase() == "gand") || (event.body.toLowerCase() == "gandu") || (event.body.toLowerCase() == "lund") || (event.body.toLowerCase() == "land")) {
     return api.sendMessage("GAAND MEI JYADA KHUJLI HAI TOH MERA 🍌 BANANA UDHAAR LE LE 😂", threadID);
   };

   if ((event.body.toLowerCase() == "chuma de") || (event.body.toLowerCase() == "kiss me")) {
     return api.sendMessage("️ Kɪss ᴋʜᴜsʜɪ ᴍᴇ ᴍᴀɪ sɪʀғ ᴀᴘɴᴇ ʙᴀʙᴜ ᴋᴏ ᴋɪss ᴅᴇᴛᴀ ʜᴜ 😛✌️", threadID);
   };

   if ((event.body.toLowerCase() == "nice") || (event.body.toLowerCase() == "thank you") || (event.body.toLowerCase() == "thank you bot") || (event.body.toLowerCase() == "thank you maliha")) {
     return api.sendMessage("️ Mᴀɪ ʜᴜ ʜɪ ᴇᴛɴᴀ ᴀᴄʜᴀ ᴋɪ sᴀʙ ᴍᴇʀɪ ᴛᴀʀɪғ ʜɪ ᴋᴀʀᴛᴇ ʜᴀɪ ᴍᴇʀɪ ʙᴀʜᴀɴ ᴋᴏ ᴄʜᴏʀʜ ᴋᴇ 😌😌👈", threadID);
   };

   if ((event.body.toLowerCase() == "😡") || (event.body.toLowerCase() == "😤") || (event.body.toLowerCase() == "😠") || (event.body.toLowerCase() == "🤬") || (event.body.toLowerCase() == "😾")) {
     return api.sendMessage("️Gᴜssᴀ ᴋʏᴜ ʜᴏ ʀʜɪ ʜᴏ ᴍᴇʀɪ ᴊᴀᴀɴ ᴍᴀɪ 🥺 ᴛᴏ ʙᴀs ᴍᴊᴀᴋ ᴋᴀʀ ʀʜᴀ ᴛʜᴀ 🥹  ᴇᴋ ᴄʜᴜᴍᴍᴀ ʟᴏ ᴀᴜʀ ᴋʜᴜsʜ ʜᴏ ᴊᴀᴏ 💋 😁", threadID);
   };

   if ((event.body.toLowerCase() == "😞") || (event.body.toLowerCase() == "😔") || (event.body.toLowerCase() == "😣") || (event.body.toLowerCase() == "☹️") || (event.body.toLowerCase() == "😟") || (event.body.toLowerCase() == "😩") || (event.body.toLowerCase() == "😖") || (event.body.toLowerCase() == "😫") || (event.body.toLowerCase() == "😦") || (event.body.toLowerCase() == "😧") || (event.body.toLowerCase() == "😥") || (event.body.toLowerCase() == "😓") || (event.body.toLowerCase() == "😰")) {
     return api.sendMessage("️Kʏᴀ ʜᴜᴀᴀ ʙᴀʙᴜ ᴜᴅᴀsʜ ᴋʏᴜ ʜᴏ ᴍᴜᴊʜᴇ ʙᴛᴀᴏ 🥺✌️", threadID);
   };


   if ((event.body.toLowerCase() == "hm") || (event.body.toLowerCase() == "hmm")) {
     return api.sendMessage("️Dᴇᴋʜᴏ ᴊᴀɴᴜ ʙᴀᴀᴛ ᴋɪʏᴀ ᴋʀᴏ ʙʜɪsʜ ᴋɪ ᴛᴀʀᴀʜ ʜᴍᴍ ʜᴍᴍ ᴍᴀᴛ ᴋʀᴏ 😒👈", threadID);
   };

   if ((event.body.toLowerCase() == "😢") || (event.body.toLowerCase() == "😢😢") || (event.body.toLowerCase() == "🥺") || (event.body.toLowerCase() == "🥹")) {
     return api.sendMessage("️Aʀᴇ ʙᴀʙᴜ ʀᴏᴛᴇ ɴʜɪ 😐", threadID);
   };

   if ((event.body.toLowerCase() == "😷") || (event.body.toLowerCase() == "🤕") || (event.body.toLowerCase() == "🤧") || (event.body.toLowerCase() == "🤒")) {
     return api.sendMessage("️Kɪʏᴀ ʜᴜᴀᴀ ʙᴀʙᴜ ᴛᴀʙɪʏᴀᴛ ᴋʜʀᴀʙ ʜᴀɪ ᴋʏᴀ 😢 ᴍᴜᴊʜᴇ ʙᴛᴀᴏ ᴍᴀɪ 💊 ᴛᴀʙʟᴇᴛ ʟᴇᴋᴇ ᴀᴀᴜ😇", threadID);
   };

   if ((event.body.toLowerCase() == "name kya h") || (event.body.toLowerCase() == "naam kya hai") || (event.body.toLowerCase() == "naam kiya hai")) {
     return api.sendMessage("️Oʏᴇ ᴛᴇʀᴀ ʟɪᴘs 👄 ᴋᴀʜᴀ ʜᴀɪ🤔👈", threadID);
   };

  if ((event.body.toLowerCase() == "😉") || (event.body.toLowerCase() == "😉😉")) {
     return api.sendMessage("️Aᴀɴᴋʜ ᴋʏᴜ ᴍᴀʀ ʀʜᴇ ʜᴏ 🥺🤟", threadID);
   };

   if ((event.body.toLowerCase() == "😏") || (event.body.toLowerCase() == "😏😏")) {
     return api.sendMessage("️Kɪʏᴀ ʜᴜᴀᴀ ʙᴀʙᴜ 🤔🤟", threadID);
   };

   if ((event.body.toLowerCase() == "😱") || (event.body.toLowerCase() == "😨")) {
     return api.sendMessage("️Kʏᴀ ʜᴜᴀᴀ ʙʜᴏᴏᴛ ᴅᴇᴋʜ ʟɪʏᴀ ᴋʏᴀ 👻👻", threadID);
   };

  if ((event.body.toLowerCase() == "🙄") || (event.body.toLowerCase() == "🙄🙄")) {
     return api.sendMessage("️Uᴘᴇʀ ᴋʏᴀ ᴅᴇᴋʜ ʀʜɪ ʜᴏ ᴍᴇʀɪ ᴊᴀᴀɴ 🙂🤟", threadID);
   };

  if ((event.body.toLowerCase() == "😒") || (event.body.toLowerCase() == "😒😒")) {
     return api.sendMessag("Oʟᴇ ᴏʟᴇ ᴍᴇʀᴀ ʙᴀʙᴜ 😛✌️", threadID);
   };

   if ((event.body.toLowerCase() == "🤦🏻‍♂") || (event.body.toLowerCase() == "🤦🏻‍♀")) {
     return api.sendMessage("Aʀᴇ ᴀᴘɴᴇ ᴍᴜʜ ᴘᴇ ᴋʏᴜ ᴍᴀʀ ʀʜᴇ ᴘᴀɢᴀʟ ᴛʜᴀʀᴋɪɪ 😅✌️", threadID);
   };

  if ((event.body.toLowerCase() == "😎") || (event.body.toLowerCase() == "😎")) {
     return api.sendMessage("️Oʏᴇ ʜᴏʏ ᴀᴀᴘᴋᴀ ᴄʜᴀsʜᴍᴀ ʙɪʟᴋᴜʟ ʙᴇᴋᴀʀ ʜᴀɪ 😂👈", threadID);
   };

  if ((event.body.toLowerCase() == "😂") || (event.body.toLowerCase() == "😂😂") || (event.body.toLowerCase() == "😂😂😂") || (event.body.toLowerCase() == "😂😂😂😂") || (event.body.toLowerCase() == "😂😂😂😂😂") || (event.body.toLowerCase() == "😂😂😂😂😂😂")) {
     return api.sendMessage("Jʏᴀᴅᴀ ᴍᴀᴛ ʜᴀsʜᴏ ᴡᴀʀɴᴀ ᴅᴀᴀᴛ ᴛᴏᴅ ᴅᴜɴɢᴀ 🙂🤟", threadID);
   };

   if ((event.body.toLowerCase() == "😁😁") || (event.body.toLowerCase() == "😁") || (event.body.toLowerCase() == "😆") || (event.body.toLowerCase() == "🤐") || (event.body.toLowerCase() == "😕") || (event.body.toLowerCase() == "😐")) {
     return api.sendMessage("🤨🤨🤨🤨🤨", threadID);
   };

   if ((event.body.toLowerCase() == "😍😍") || (event.body.toLowerCase() == "😍") || (event.body.toLowerCase() == "😻") || (event.body.toLowerCase() == "🤩")) {
     return api.sendMessage("Hᴏᴛʜ ᴘᴀʀ ʜᴀsʜɪ 😁 ᴀᴀɴᴋʜᴏ ᴍᴇ ɴᴀᴍɪ ʜᴀɪ 🫣ʜᴀʀ sʜᴀɴsʜ ᴋᴀʜᴛɪ ʜᴀɪ 🙂ʙs ᴛᴇʀɪ ʜɪ ᴋᴀᴍɪ  ʜᴀɪ 🤤👈", threadID);
   };

   if ((event.body.toLowerCase() == "kese ho") || (event.body.toLowerCase() == "kaise ho") || (event.body.toLowerCase() == "kese ho ji") || (event.body.toLowerCase() == "how are you") || (event.body.toLowerCase() == "how are you?")) {
     return api.sendMessage("Mᴀɪ ᴀxʜᴀ ʜᴜ ᴀᴀᴘ ᴋᴀɪsᴇ ʜᴏ ᴍᴇʀɪ ᴊᴀᴀɴ 😇☺👈", threadID);
   };

  if ((event.body.toLowerCase() == "🤖") || (event.body.toLowerCase() == "🤖")) {
     return api.sendMessage("Oʏᴇ ᴍᴜᴊʜᴇ ᴄʜɪᴅʜᴀ ʀʜᴇ ʜᴏ ʙsᴅᴋ🙁👈", threadID);
   };

  if ((event.body.toLowerCase() == "love you") || (event.body.toLowerCase() == "i love you")) {
     return api.sendMessage("𝗜 𝗟𝗼𝘃𝗲 𝘆𝗼𝘂 𝘁𝗼𝗼 𝗝𝗮𝗮𝗻 😘", threadID);
   };

   mess = "{name}"

  if (event.body.includes("Bot") == 1 ||
   (event.body.includes("bot") == 1 ||
   (event.body.includes("Taklu") == 1 ||
   (event.body.includes("taklu") == 1 ||
   (event.body.includes("टकलू") == 1 ||
   (event.body.includes("tklu") == 1 ||
   (event.body.includes("Tklu") == 1 ||
   (event.body.includes("Oye") == 1 ||
   (event.body.includes("oye") == 1 ))))))))) {
    var msg = {
      body: `${rand}`
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
